; domain
(define (domain blocksworld)
  (:requirements :strips :constraints :negative-preconditions)
  (:predicates (pred_2 ?v1)
               (pred_3 ?v1)
               (pred_5)
               (pred_1 ?v1)
               (pred_4 ?v1 ?v2))

  (:action op_2
    :parameters (?v4)
    :precondition (and (pred_2 ?v4) (pred_3 ?v4) (pred_5))
    :effect (and (pred_1 ?v4) (not (pred_2 ?v4)) (not (pred_3 ?v4)) 
                 (not (pred_5))))

  (:action op_4
    :parameters  (?v4)
    :precondition (pred_1 ?v4)
    :effect (and (pred_2 ?v4) (pred_5) (pred_3 ?v4) 
                 (not (pred_1 ?v4))))

  (:action op_3
    :parameters  (?v4 ?v3)
    :precondition (and (pred_2 ?v3) (pred_1 ?v4))
    :effect (and (pred_5) (pred_2 ?v4) (pred_4 ?v4 ?v3)
                 (not (pred_2 ?v3)) (not (pred_1 ?v4))))

  (:action op_1
    :parameters  (?v4 ?v3)
    :precondition (and (pred_4 ?v4 ?v3) (pred_2 ?v4) (pred_5))
    :effect (and (pred_1 ?v4) (pred_2 ?v3)
                 (not (pred_4 ?v4 ?v3)) (not (pred_2 ?v4)) (not (pred_5)))))

; problem
(define (problem BW-rand-6)
(:domain blocksworld)
(:objects obj_01 obj_03 obj_02 obj_04 obj_06 obj_05 )
(:init
(pred_5)
(pred_4 obj_01 obj_02)
(pred_4 obj_03 obj_05)
(pred_3 obj_02)
(pred_4 obj_04 obj_06)
(pred_4 obj_06 obj_01)
(pred_3 obj_05)
(pred_2 obj_03)
(pred_2 obj_04)
)
(:goal
(and
(pred_4 obj_01 obj_06)
(pred_4 obj_03 obj_04)
(pred_4 obj_02 obj_05)
(pred_4 obj_06 obj_03)
(pred_4 obj_05 obj_01))
)

(:constraints
  (sometime-before (pred_4 obj_03 obj_04) (pred_4 obj_01 obj_06))
)
)

; plan
1. (op_1 obj_04 obj_06)
   deleted: (pred_4 obj_04 obj_06) (pred_2 obj_04) (pred_5)
   added: (pred_1 obj_04) (pred_2 obj_06)
   goals met: 0 of 5
2. (op_4 obj_04)
   deleted: (pred_1 obj_04)
   added: (pred_2 obj_04) (pred_5) (pred_3 obj_04)
   goals met: 0 of 5
3. (op_1 obj_06 obj_01)
   deleted: (pred_4 obj_06 obj_01) (pred_2 obj_06) (pred_5)
   added: (pred_1 obj_06) (pred_2 obj_01)
   goals met: 0 of 5
4. (op_4 obj_06)
   deleted: (pred_1 obj_06)
   added: (pred_2 obj_06) (pred_5) (pred_3 obj_06)
   goals met: 0 of 5
5. (op_1 obj_01 obj_02)
   deleted: (pred_4 obj_01 obj_02) (pred_2 obj_01) (pred_5)
   added: (pred_1 obj_01) (pred_2 obj_02)
   goals met: 0 of 5
6. (op_3 obj_01 obj_06)
   deleted: (pred_2 obj_06) (pred_1 obj_01)
   added: (pred_5) (pred_2 obj_01) (pred_4 obj_01 obj_06)
   goals met: 1 of 5
7. (op_1 obj_03 obj_05)
   deleted: (pred_4 obj_03 obj_05) (pred_2 obj_03) (pred_5)
   added: (pred_1 obj_03) (pred_2 obj_05)
   goals met: 1 of 5
8. (op_3 obj_03 obj_04)
   deleted: (pred_2 obj_04) (pred_1 obj_03)
   added: (pred_5) (pred_2 obj_03) (pred_4 obj_03 obj_04)
   goals met: 2 of 5
9. (op_2 obj_02)
   deleted: (pred_2 obj_02) (pred_3 obj_02) (pred_5)
   added: (pred_1 obj_02)
   goals met: 2 of 5
10. (op_3 obj_02 obj_05)
   deleted: (pred_2 obj_05) (pred_1 obj_02)
   added: (pred_5) (pred_2 obj_02) (pred_4 obj_02 obj_05)
   goals met: 3 of 5
11. (op_1 obj_01 obj_06)
   deleted: (pred_4 obj_01 obj_06) (pred_2 obj_01) (pred_5)
   added: (pred_1 obj_01) (pred_2 obj_06)
   goals met: 2 of 5
12. (op_4 obj_01)
   deleted: (pred_1 obj_01)
   added: (pred_2 obj_01) (pred_5) (pred_3 obj_01)
   goals met: 2 of 5
13. (op_2 obj_06)
   deleted: (pred_2 obj_06) (pred_3 obj_06) (pred_5)
   added: (pred_1 obj_06)
   goals met: 2 of 5
14. (op_3 obj_06 obj_03)
   deleted: (pred_2 obj_03) (pred_1 obj_06)
   added: (pred_5) (pred_2 obj_06) (pred_4 obj_06 obj_03)
   goals met: 3 of 5
15. (op_2 obj_01)
   deleted: (pred_2 obj_01) (pred_3 obj_01) (pred_5)
   added: (pred_1 obj_01)
   goals met: 3 of 5
16. (op_3 obj_01 obj_06)
   deleted: (pred_2 obj_06) (pred_1 obj_01)
   added: (pred_5) (pred_2 obj_01) (pred_4 obj_01 obj_06)
   goals met: 4 of 5
17. (op_1 obj_02 obj_05)
   deleted: (pred_4 obj_02 obj_05) (pred_2 obj_02) (pred_5)
   added: (pred_1 obj_02) (pred_2 obj_05)
   goals met: 3 of 5
18. (op_4 obj_02)
   deleted: (pred_1 obj_02)
   added: (pred_2 obj_02) (pred_5) (pred_3 obj_02)
   goals met: 3 of 5
19. (op_2 obj_05)
   deleted: (pred_2 obj_05) (pred_3 obj_05) (pred_5)
   added: (pred_1 obj_05)
   goals met: 3 of 5
20. (op_3 obj_05 obj_01)
   deleted: (pred_2 obj_01) (pred_1 obj_05)
   added: (pred_5) (pred_2 obj_05) (pred_4 obj_05 obj_01)
   goals met: 4 of 5
21. (op_2 obj_02)
   deleted: (pred_2 obj_02) (pred_3 obj_02) (pred_5)
   added: (pred_1 obj_02)
   goals met: 4 of 5
22. (op_3 obj_02 obj_05)
   deleted: (pred_2 obj_05) (pred_1 obj_02)
   added: (pred_5) (pred_2 obj_02) (pred_4 obj_02 obj_05)
   goals met: 5 of 5
